wkndeng/netmf-interpreter/DeviceCode/Targets/Native/STM32L4/DeviceCode/STM32L4_USB/STM32L4_usb_functions.cpp
BOOL CPU_USB_StartOutput( USB_CONTROLLER_STATE* State, int ep )
{
    if( State == NULL || ep >= State->EndpointCount )
        return FALSE;

    OTG_TypeDef* OTG = STM32L4_USB_REGS( State->ControllerNum );

    USB_Debug( 't' );

    GLOBAL_LOCK( irq );

    // If endpoint is not an output
    if( State->Queues[ ep ] == NULL || !State->IsTxQueue[ ep ] )
        return FALSE;

    /* if the halt feature for this endpoint is set, then just clear all the characters */
    if( State->EndpointStatus[ ep ] & USB_STATUS_ENDPOINT_HALT )
    {
        while( USB_TxDequeue( State, ep, TRUE ) != NULL )
        {
        } // clear TX queue

        return TRUE;
    }

    if( irq.WasDisabled( ) )
    { // check all endpoints for pending actions
        STM32L4_USB_Driver_Interrupt( OTG, State );
    }
    // write first packet if not done yet
    STM32L4_USB_Driver_EP_In_Int( OTG, State, ep );

    return TRUE;
}

BOOL CPU_USB_RxEnable( USB_CONTROLLER_STATE* State, int ep )
{
    // If this is not a legal Rx queue
    if( State == NULL || State->Queues[ ep ] == NULL || State->IsTxQueue[ ep ] )
        return FALSE;

    OTG_TypeDef* OTG = STM32L4_USB_REGS( State->ControllerNum );

    USB_Debug( 'e' );

    GLOBAL_LOCK( irq );

    // enable Rx
    if( !( OTG->DOEP[ ep ].CTL & OTG_DOEPCTL_EPENA ) )
    {
        OTG->DOEP[ ep ].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | State->MaxPacketSize[ ep ];
        OTG->DOEP[ ep ].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK; // enable endpoint
    }

    return TRUE;
}

BOOL CPU_USB_GetInterruptState( ) // Controller missing!
{
    return FALSE;
}

BOOL CPU_USB_ProtectPins( int Controller, BOOL On )
{
    USB_CONTROLLER_STATE *State = &STM32L4_USB_ControllerState[ STM32L4_USB_IDX( Controller ) ].state;

    if( ( ( STM32L4_USB_STATE* )State )->EP_Type == 0 )
        return FALSE;  // not yet initialized

    OTG_TypeDef* OTG = STM32L4_USB_REGS( Controller );

    GLOBAL_LOCK( irq );

    if( On )
    {
        if( !( ( STM32L4_USB_STATE* )State )->pinsProtected )
        {
            USB_Debug( '+' );

            ( ( STM32L4_USB_STATE* )State )->pinsProtected = TRUE;

            // detach usb port
            OTG->DCTL |= OTG_DCTL_SDIS; // soft disconnect

            // clear USB Txbuffer
            for( int ep = 1; ep < State->EndpointCount; ep++ )
            {
                if( State->Queues[ ep ] && State->IsTxQueue[ ep ] )
                {
                    while( USB_TxDequeue( State, ep, TRUE ) != NULL );  // clear TX queue
                }
            }

            State->DeviceState = USB_DEVICE_STATE_DETACHED;
            USB_StateCallback( State );
        }
    }
    else
    {
        if( ( ( STM32L4_USB_STATE* )State )->pinsProtected )
        {

            USB_Debug( '-' );

            ( ( STM32L4_USB_STATE* )State )->pinsProtected = FALSE;

            GPIO_ALT_MODE altMode = STM32L4_USB_ALT_MODE( Controller );
            CPU_GPIO_DisablePin( STM32L4_USB_DM_PIN( Controller ), RESISTOR_DISABLED, 0, altMode );
            CPU_GPIO_DisablePin( STM32L4_USB_DP_PIN( Controller ), RESISTOR_DISABLED, 0, altMode );
            if( STM32L4_USB_USE_ID_PIN( Controller ) )
            {
                CPU_GPIO_DisablePin( STM32L4_USB_ID_PIN( Controller ), RESISTOR_DISABLED, 0, altMode );
            }

            // attach usb port
            OTG->DCTL &= ~OTG_DCTL_SDIS; // remove soft disconnect

            State->DeviceState = USB_DEVICE_STATE_ATTACHED;
            USB_StateCallback( State );
        }
    }

    return TRUE;
}

